In [1]:
import pandas as pd

In [2]:
df_customers = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/customers.csv")
df_transactions = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/transactions.csv")
df_products = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/products.csv")

In [3]:
df_customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [4]:
df_transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

In [5]:
df_products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [7]:
df_merged = pd.merge(df_transactions, df_products, on='id_prod')
df_merged.head()

  id_prod                        date session_id client_id  price  categ
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103   4.18      0
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534  15.99      1
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714   7.99      0
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941  69.99      2
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232   4.99      0

In [8]:
df_final = pd.merge(df_merged, df_customers, on='client_id')
df_final.head()

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0,f,1986
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1,m,1988
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0,f,1968
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2,m,2000
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0,m,1980